renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx72n/r_qspi_smstr_target_dev_port.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2019 Renesas Electronics Corporation. All rights reserved.
*******************************************************************************/
/*******************************************************************************
* System Name  : QSPI single master driver
* File Name    : r_qspi_smstr_target_dev_port.c
* Version      : 1.21
* Device       : RX
* Abstract     : Source file dedicated to RX72N for QSPI single master driver
* Tool-Chain   : Renesas RXC Toolchain v3.05.00
* OS           : not use
* H/W Platform : not use
* Description  : Functions for QSPI single master driver
* Limitation   : none
*******************************************************************************/
/*******************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 22.11.2019 1.14     First Release
*              : 15.06.2023 1.21     Fixed typo in the comment of the r_qspi_smstr_check_timer()
*              :                     Fixed typo in the comment of the r_qspi_smstr_tx_dmacdtc_wait()
*              :                     Fixed typo in the comment of the r_qspi_smstr_rx_dmacdtc_wait()
*******************************************************************************/

/*******************************************************************************
Includes <System Includes> , "Project Includes"
*******************************************************************************/
/* Public interface header file for this package. */
#include "r_qspi_smstr_rx_if.h"
/* Configuration for this package. */
#include "r_qspi_smstr_rx_config.h"
/* Private header file for this package. */
#include "./src/r_qspi_smstr_private.h"

/* Check MCU Group */
#if defined(BSP_MCU_RX72N)


/*******************************************************************************
Macro definitions
*******************************************************************************/
#define QSPI_TIMER_CH_FLG          (0)
#define QSPI_TIMER_CH_COUNT        (1)
#define QSPI_TIMER_CH_MAX_COUNT    (2)
#define QSPI_TIMER_MIN_TIME        (100)       /* 100ms                    */
#define QSPI_SECTOR_SIZE           (512)       /* 1 sector size            */


/*******************************************************************************
Private variables and functions
*******************************************************************************/
static volatile uint8_t  gs_qspi_int_spti_dmacdtc_flg[QSPI_NUM_CHANNELS];
static volatile uint8_t  gs_qspi_int_spri_dmacdtc_flg[QSPI_NUM_CHANNELS];
static volatile uint32_t gs_qspi_timer_cnt_out[QSPI_NUM_CHANNELS][QSPI_TIMER_CH_MAX_COUNT + 1];

static void                 r_qspi_smstr_start_timer(uint8_t channel, uint32_t msec);
static qspi_smstr_status_t  r_qspi_smstr_check_timer(uint8_t channel);
static void                 r_qspi_smstr_end_timer(uint8_t channel);

#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
R_BSP_PRAGMA_STATIC_INTERRUPT(r_qspi_smstr_spti_isr0, VECT(QSPI, SPTI))
R_BSP_ATTRIB_STATIC_INTERRUPT void r_qspi_smstr_spti_isr0(void)
{
    R_QSPI_SMstr_Int_Spti_Ier_Clear(0);
    R_QSPI_SMstr_Int_Spti_Dmacdtc_Flag_Set(0, QSPI_SET_TRANS_STOP);
}

R_BSP_PRAGMA_STATIC_INTERRUPT(r_qspi_smstr_spri_isr0, VECT(QSPI, SPRI))
R_BSP_ATTRIB_STATIC_INTERRUPT void r_qspi_smstr_spri_isr0(void)
{
    R_QSPI_SMstr_Int_Spri_Ier_Clear(0);
    R_QSPI_SMstr_Int_Spri_Dmacdtc_Flag_Set(0, QSPI_SET_TRANS_STOP);
}
#endif  /* defined(QSPI_SMSTR_CFG_CH0_INCLUDED) */


/*******************************************************************************
* Function Name: r_qspi_smstr_io_init
* Description  : Initializes setting of ports used for QSPI.
* Arguments    : channel -
*                    Which channel to use.
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_io_init(uint8_t channel)
{
    r_qspi_smstr_mpc_disable(channel);    /* MPC : use as general I/O port.   */
    r_qspi_smstr_clk_init(channel);       /* Initialize port for QSPCLK.      */
    r_qspi_smstr_dataio0_init(channel);   /* Initialize port for QMO/QIO0.    */
    r_qspi_smstr_dataio1_init(channel);   /* Initialize port for QMI/QIO1.    */
    r_qspi_smstr_dataio2_init(channel);   /* Initialize port for QIO2.        */
    r_qspi_smstr_dataio3_init(channel);   /* Initialize port for QIO3.        */
}


/*******************************************************************************
* Function Name: r_qspi_smstr_io_reset
* Description  : Resets setting of ports used for QSPI.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_io_reset(uint8_t channel)
{
    r_qspi_smstr_mpc_disable(channel);    /* MPC : use as general I/O port.   */
}


