renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx72n/r_qspi_smstr_target_dev_port.c
/*******************************************************************************
* Function Name: r_qspi_smstr_dataio0_init
* Description  : Initializes setting of port for QMO/QIO0.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio0_init(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QMO/QIO0 ---- */
            QSPI_CH0_ODR_DATAIO0    = 0;                /* Output type is CMOS output.              */
            QSPI_CH0_PCR_DATAIO0    = 0;                /* Disable input pull-up resistor.          */
    #if (('J' != R_QSPI_SMSTR_CFG_QSPI_QIO0_PORT) && ('3' != R_QSPI_SMSTR_CFG_QSPI_QIO0_BIT))
            QSPI_CH0_DSCR_DATAIO0   = 1;                /* Drive capacity is High-drive output.     */
    #endif
            QSPI_CH0_PDR_DATAIO0    = QSPI_SMSTR_IN;    /* Select input direction.                  */
            if (QSPI_SMSTR_IN == QSPI_CH0_PDR_DATAIO0)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dataio0_reset
* Description  : Resets setting of port for QMO/QIO0.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio0_reset(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QMO/QIO0 ---- */
            QSPI_CH0_PDR_DATAIO0    = QSPI_SMSTR_IN;  /* Select input direction.                  */
    #if (('J' != R_QSPI_SMSTR_CFG_QSPI_QIO0_PORT) && ('3' != R_QSPI_SMSTR_CFG_QSPI_QIO0_BIT))
            QSPI_CH0_DSCR_DATAIO0   = 0;              /* Drive capacity is normal drive output.   */
    #endif
            QSPI_CH0_PCR_DATAIO0    = 0;              /* Disable input pull-up resistor.          */
            QSPI_CH0_ODR_DATAIO0    = 0;              /* Output type is CMOS output.              */
            if (0 == QSPI_CH0_ODR_DATAIO0)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dataio1_init
* Description  : Initializes setting of port for QMI/QIO1.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio1_init(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QMI/QIO1 ---- */
            QSPI_CH0_ODR_DATAIO1    = 0;              /* Output type is CMOS output.              */
            QSPI_CH0_PCR_DATAIO1    = 0;              /* Disable input pull-up resistor.          */
    #if (('J' != R_QSPI_SMSTR_CFG_QSPI_QIO1_PORT) && ('5' != R_QSPI_SMSTR_CFG_QSPI_QIO1_BIT))
            QSPI_CH0_DSCR_DATAIO1   = 1;              /* Drive capacity is High-drive output.     */
    #endif
            QSPI_CH0_PDR_DATAIO1    = QSPI_SMSTR_IN;  /* Select input direction.                  */
            if (QSPI_SMSTR_IN == QSPI_CH0_PDR_DATAIO1)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dataio1_reset
* Description  : Resets setting of port for QMI/QIO1.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio1_reset(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QMI/QIO1 ---- */
            QSPI_CH0_PDR_DATAIO1    = QSPI_SMSTR_IN;  /* Select input direction.                  */
    #if (('J' != R_QSPI_SMSTR_CFG_QSPI_QIO1_PORT) && ('5' != R_QSPI_SMSTR_CFG_QSPI_QIO1_BIT))
            QSPI_CH0_DSCR_DATAIO1   = 0;              /* Drive capacity is normal drive output.   */
    #endif
            QSPI_CH0_PCR_DATAIO1    = 0;              /* Disable input pull-up resistor.          */
            QSPI_CH0_ODR_DATAIO1    = 0;              /* Output type is CMOS output.              */
            if (0 == QSPI_CH0_ODR_DATAIO1)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dataio2_init
* Description  : Initializes setting of port for QIO2.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio2_init(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QIO2 ---- */
            QSPI_CH0_ODR_DATAIO2    = 0;              /* Output type is CMOS output.              */
            QSPI_CH0_PCR_DATAIO2    = 0;              /* Disable input pull-up resistor.          */
            QSPI_CH0_DSCR_DATAIO2   = 1;              /* Drive capacity is High-drive output.     */
            QSPI_CH0_PDR_DATAIO2    = QSPI_SMSTR_IN;  /* Select input direction.                  */
            if (QSPI_SMSTR_IN == QSPI_CH0_PDR_DATAIO2)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


